from utils.output_rich import Rich

# Ваша задача — разделить шоколадку заданного размера n x m на маленькие квадраты.
# Каждый квадрат имеет размер 1 x 1 и не подлежит разделению.
# Реализуйте функцию, которая вернет минимальное количество необходимых разрезов.

# Например, если вам дана шоколадка размером 2 x 1,
# вы можете разделить ее на отдельные квадраты всего за один разрез,
# но для шоколадки размером 3 x 1 потребуется два разреза.

# Если входные данные некорректны, верните 0
# (то есть если у нас нет шоколада, который нужно разделить, то разрезов не требуется).
# Входные данные всегда будут представлять собой неотрицательное целое число.

Rich.simple_log("Делим шоколадку")

size_of_chocolate = Rich.input_data("Введите размер шоколадки (в ячейках n*m, например '4*5')")

n_size_of_chocolate, m_size_of_chocolate = size_of_chocolate.split("*")

n_size_of_chocolate = int(n_size_of_chocolate)
m_size_of_chocolate = int(m_size_of_chocolate)

def stripped_the_chocolate(n: int, m: int) -> int:
    """
    Функция, вычисляющая минимальное количество операций, необходимых для того, чтобы
     'разрезать' шоколадку n*m ячеек размером на ячейки размером 1*1.

    :param n: int - количество рядов ячеек в шоколадке
    :param m: int - количество строк ячеек в шоколадке

    :return: int - минимальное количество операций, необходимых для рездалки шоколадки
    """

    if n <= 0 or m <= 0:
        Rich.log_error(f"Введён некорректный размер шоколадки: {n}*{m}")
        return 0

    if (n - 1) >= 1:
        n_cuts = n - 1
    else:
        n_cuts = 1

    if (m - 1) >= 1:
        m_cuts = m - 1
    else:
        m_cuts = 1

    count_cuts = n_cuts + m_cuts

    Rich.success_log(f"Для того, чтобы разделить шоколадку размером {n}*{m} "
                     f"на ячейки 1*1 потребуется {count_cuts} разрезов")

    return count_cuts


stripped_the_chocolate(n_size_of_chocolate, m_size_of_chocolate)
